package edu.zju.zjh.core.extend;

/**
 * @author: zjh
 * @date : 2022/5/25 14:55
 * @Email : 2757412961@qq.com
 * @update:
 */

public class Child extends Father {

    /**
     * java中只要调用子类的构造函数就要调用父类无参数的构造函数吗？若父类中不存在无参数构造函数会出错吗?
     * <p>
     * 答：Java中只要调用子类的构造函数就一定会调用父类的构造函数，这是毋庸置疑的！
     * 有时我们并没有在父类中写有参和无参的构造方法，但是这样我们在定义子类对象时调用子类构造函数时，其实也调用父类的构造函数，
     * 这是系统自动为我们添加的“public Father(){}”。但是如果我们在父类中已经自己定义了有参的构造方法，却没有定义无参的构造方法，
     * 那么此时系统是不会为我们自动添加无参的构造方法的，此时程序结果就会提醒你父类没有无参的构造方法，程序就会报错。
     */

    public Child() {
        /**
         * 如果我们在父类中已经自己定义了有参的构造方法，却没有定义无参的构造方法，
         * 那么此时系统是不会为我们自动添加无参的构造方法的，此时程序结果就会提醒你父类没有无参的构造方法，程序就会报错。
         */
    }

    public Child(int father) {
        super(father);
    }

}
